cats_99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "Spotted"], ["description", "Likes sunbathing and eating ice cream while watching netflix"], ["updated_at", "2018-11-14 01:03:52.019165"], ["id", 7]]
---
  def update
    cat = Cat.find(params[:id])

    if cat.update(cat_params)